In [2]:
%load_ext sql
%sql mysql://root:pieseczek71@localhost/resteurant_db

# Creating a schema

In [3]:
%%sql
USE resteurant_db;

 * mysql://root:***@localhost/resteurant_db
0 rows affected.

[]

In [4]:
%%sql

CREATE SCHEMA IF NOT EXISTS resteurant_db;
USE resteurant_db;

CREATE TABLE IF NOT EXISTS ingredient(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64) NOT NULL,
    price DECIMAL(10,2) NOT NULL,
    isVegan BOOLEAN NOT NULL,
    isVegeterian BOOLEAN NOT NULL
);

CREATE TABLE IF NOT EXISTS pizzaIngredient(
    pizzaID INT NOT NULL,
    ingredientID INT NOT NULL,
    quantity INT NOT NULL
);

CREATE TABLE IF NOT EXISTS item(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    itemType VARCHAR(6) NOT NULL,
    name VARCHAR(64) NOT NULL,
    price DECIMAL(10,2) NOT NULL,
    isVegan BOOLEAN,
    isVegeterian BOOLEAN
);

CREATE TABLE IF NOT EXISTS orderItem(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    itemID INT NOT NULL,
    quantity INT NOT NULL
);

CREATE TABLE IF NOT EXISTS discountCode(
    ID VARCHAR(8) PRIMARY KEY,
    isUSED BOOLEAN NOT NULL,
    percentage INT NOT NULL
);

CREATE TABLE IF NOT EXISTS deliveryPersonnel(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    firstName VARCHAR(64) NOT NULL,
    lastName VARCHAR(64) NOT NULL,
    postalCode VARCHAR(6) NOT NULL
);

CREATE TABLE IF NOT EXISTS customer(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    firstName VARCHAR(64) NOT NULL,
    lastName VARCHAR(64) NOT NULL,
    gender CHAR(1) NOT NULL,
    birthDate DATE NOT NULL,
    phoneNumber VARCHAR(12) NOT NULL,
    email VARCHAR(100) NOT NULL UNIQUE,
    address VARCHAR(100) NOT NULL,
    postalCode VARCHAR(6) NOT NULL,
    city VARCHAR(64) NOT NULL,
    pizzaCount INT NOT NULL
);

CREATE TABLE IF NOT EXISTS `order`(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    customerID INT NOT NULL,
    placementDate DATETIME NOT NULL,
    pickedUpByDeliveryPersonnelDate DATETIME,
    status VARCHAR(32) NOT NULL,
    price DECIMAL(10,2) NOT NULL,
    discountCodeID VARCHAR(8),
    deliveryPersonnelID INT
);

 * mysql://root:***@localhost/resteurant_db
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [22]:
%%sql
ALTER TABLE customer
ADD CONSTRAINT UQ_customer_email UNIQUE (email);

 * mysql://root:***@localhost/resteurant_db
0 rows affected.

[]

### Adding relationships

In [6]:
%%sql 

ALTER TABLE `order`
    ADD CONSTRAINT fk_order_customer
    FOREIGN KEY (customerID) REFERENCES customer(ID) ON DELETE CASCADE;

 * mysql://root:***@localhost/resteurant_db
(MySQLdb.OperationalError) (1826, "Duplicate foreign key constraint name 'fk_order_customer'")
[SQL: ALTER TABLE `order`
    ADD CONSTRAINT fk_order_customer
    FOREIGN KEY (customerID) REFERENCES customer(ID) ON DELETE CASCADE;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
%%sql

ALTER TABLE `order`
    ADD CONSTRAINT fk_order_deliveryPersonnel 
    FOREIGN KEY (deliveryPersonnelID) REFERENCES deliveryPersonnel(ID) ON DELETE SET NULL;

 * mysql://root:***@localhost/resteurant_db
(MySQLdb.OperationalError) (1826, "Duplicate foreign key constraint name 'fk_order_deliveryPersonnel'")
[SQL: ALTER TABLE `order`
    ADD CONSTRAINT fk_order_deliveryPersonnel
    FOREIGN KEY (deliveryPersonnelID) REFERENCES deliveryPersonnel(ID) ON DELETE SET NULL;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%%sql 

ALTER TABLE `order`
    ADD CONSTRAINT fk_order_discountCode 
    FOREIGN KEY (discountCodeID) REFERENCES discountCode(ID) ON DELETE SET NULL;

 * mysql://root:***@localhost/resteurant_db
(MySQLdb.OperationalError) (1826, "Duplicate foreign key constraint name 'fk_order_discountCode'")
[SQL: ALTER TABLE `order`
    ADD CONSTRAINT fk_order_discountCode
    FOREIGN KEY (discountCodeID) REFERENCES discountCode(ID) ON DELETE SET NULL;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [9]:
%%sql 

ALTER TABLE orderItem
    ADD CONSTRAINT fk_orderItem_order 
    FOREIGN KEY (itemID) REFERENCES `order`(ID) ON DELETE CASCADE;

 * mysql://root:***@localhost/resteurant_db
(MySQLdb.OperationalError) (1826, "Duplicate foreign key constraint name 'fk_orderItem_order'")
[SQL: ALTER TABLE orderItem
    ADD CONSTRAINT fk_orderItem_order
    FOREIGN KEY (itemID) REFERENCES `order`(ID) ON DELETE CASCADE;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [10]:
%%sql 

ALTER TABLE orderItem
    ADD CONSTRAINT fk_orderItem_item 
    FOREIGN KEY (itemID) REFERENCES item(ID) ON DELETE RESTRICT;

 * mysql://root:***@localhost/resteurant_db
(MySQLdb.OperationalError) (1826, "Duplicate foreign key constraint name 'fk_orderItem_item'")
[SQL: ALTER TABLE orderItem
    ADD CONSTRAINT fk_orderItem_item
    FOREIGN KEY (itemID) REFERENCES item(ID) ON DELETE RESTRICT;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [11]:
%%sql 

ALTER TABLE pizzaIngredient
    ADD CONSTRAINT fk_pizzaIngredient_pizza 
    FOREIGN KEY (pizzaID) REFERENCES item(ID) ON DELETE RESTRICT;

 * mysql://root:***@localhost/resteurant_db
(MySQLdb.OperationalError) (1826, "Duplicate foreign key constraint name 'fk_pizzaIngredient_pizza'")
[SQL: ALTER TABLE pizzaIngredient
    ADD CONSTRAINT fk_pizzaIngredient_pizza
    FOREIGN KEY (pizzaID) REFERENCES item(ID) ON DELETE RESTRICT;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql 

ALTER TABLE pizzaIngredient
    ADD CONSTRAINT fk_pizzaIngredient_ingredient 
    FOREIGN KEY (ingredientID) REFERENCES ingredient(ID) ON DELETE RESTRICT;

 * mysql://root:***@localhost/resteurant_db
(MySQLdb.OperationalError) (1826, "Duplicate foreign key constraint name 'fk_pizzaIngredient_ingredient'")
[SQL: ALTER TABLE pizzaIngredient
    ADD CONSTRAINT fk_pizzaIngredient_ingredient
    FOREIGN KEY (ingredientID) REFERENCES ingredient(ID) ON DELETE RESTRICT;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
%%sql

SELECT
    CONSTRAINT_NAME,
    TABLE_NAME,
    COLUMN_NAME,
    REFERENCED_TABLE_NAME,
    REFERENCED_COLUMN_NAME
FROM
    INFORMATION_SCHEMA.KEY_COLUMN_USAGE
WHERE
    TABLE_SCHEMA = 'resteurant_db' -- replace with your schema name
    AND REFERENCED_TABLE_NAME IS NOT NULL;

 * mysql://root:***@localhost/resteurant_db
7 rows affected.

[('fk_order_customer', 'order', 'customerID', 'customer', 'ID'),
 ('fk_order_deliveryPersonnel', 'order', 'deliveryPersonnelID', 'deliveryPersonnel', 'ID'),
 ('fk_order_discountCode', 'order', 'discountCodeID', 'discountCode', 'ID'),
 ('fk_orderItem_item', 'orderItem', 'itemID', 'item', 'ID'),
 ('fk_orderItem_order', 'orderItem', 'itemID', 'order', 'ID'),
 ('fk_pizzaIngredient_ingredient', 'pizzaIngredient', 'ingredientID', 'ingredient', 'ID'),
 ('fk_pizzaIngredient_pizza', 'pizzaIngredient', 'pizzaID', 'item', 'ID')]

In [14]:
%%sql
SHOW DATABASES;

 * mysql://root:***@localhost/resteurant_db
6 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('resteurant_db',),
 ('sakila',),
 ('sys',)]

In [15]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/resteurant_db
8 rows affected.

[('customer',),
 ('deliveryPersonnel',),
 ('discountCode',),
 ('ingredient',),
 ('item',),
 ('order',),
 ('orderItem',),
 ('pizzaIngredient',)]

In [16]:
%%sql
SELECT * FROM customer;

 * mysql://root:***@localhost/resteurant_db
13 rows affected.

[(27, 'Marta', 'Adamowska', 'F', datetime.date(2005, 8, 30), '+48123456789', 'marta.adamowska@gmail.com', 'Paul-Henri Spaaklaan 1', '6229EN', 'Maastricht', 0),
 (28, 'Misia', 'Krawczyk', 'F', datetime.date(2024, 10, 2), '+48111222333', 'misia.krawczyk@gmail.com', 'Forum 100', '6229GV', 'Maastricht', 0),
 (29, 'Marta', 'Adamowska', 'F', datetime.date(2005, 8, 30), '+48123456789', 'marta.adamowska.1@gmail.com', 'Paul-Henri Spaaklaan 1', '6229EN', 'Maastricht', 0),
 (30, 'Marta', 'Adamowska', 'F', datetime.date(2005, 8, 30), '+48123456789', 'marta.adamowska@example.com', 'Paul-Henri Spaaklaan 1', '6229EN', 'Maastricht', 0),
 (31, 'John', 'Smith', 'M', datetime.date(1992, 4, 15), '+48987654321', 'john.smith@example.com', 'Main Street 2', '1234AB', 'Amsterdam', 1),
 (32, 'Emily', 'Johnson', 'F', datetime.date(1988, 12, 5), '+48123412345', 'emily.johnson@example.com', 'High Street 3', '5678CD', 'Rotterdam', 2),
 (33, 'Robert', 'Williams', 'M', datetime.date(1975, 9, 20), '+48987654322', 'robert.williams@example.com', 'First Avenue 4', '9101EF', 'Utrecht', 3),
 (34, 'Alice', 'Brown', 'F', datetime.date(1995, 1, 10), '+48123498765', 'alice.brown@example.com', 'Second Avenue 5', '2345GH', 'The Hague', 4),
 (35, 'David', 'Jones', 'M', datetime.date(1980, 11, 30), '+48987654323', 'david.jones@example.com', 'Elm Street 6', '3456IJ', 'Groningen', 5),
 (36, 'Laura', 'Miller', 'F', datetime.date(1993, 6, 25), '+48123454321', 'laura.miller@example.com', 'Oak Street 7', '4567JK', 'Nijmegen', 6),
 (37, 'Paul', 'Davis', 'M', datetime.date(1990, 3, 15), '+48987654324', 'paul.davis@example.com', 'Pine Street 8', '5678KL', 'Haarlem', 7),
 (38, 'Sara', 'Wilson', 'F', datetime.date(1998, 7, 22), '+48123476543', 'sara.wilson@example.com', 'Maple Street 9', '6789MN', 'Eindhoven', 8),
 (39, 'Mark', 'Moore', 'M', datetime.date(1985, 5, 17), '+48987654325', 'mark.moore@example.com', 'Birch Street 10', '7890OP', 'Tilburg', 9)]

In [17]:
%%sql
SELECT * FROM deliveryPersonnel;

 * mysql://root:***@localhost/resteurant_db
10 rows affected.

[(1, 'Lucas', 'Miller', '6229GV'),
 (2, 'Emma', 'Smith', '6229GV'),
 (3, 'Oliver', 'Johnson', '6229GV'),
 (4, 'Sophia', 'Williams', '6229GV'),
 (5, 'Liam', 'Brown', '6229EN'),
 (6, 'Ava', 'Jones', '6229EN'),
 (7, 'Noah', 'Garcia', '6229EN'),
 (8, 'Isabella', 'Martinez', '6229GV'),
 (9, 'Elijah', 'Davis', '6229GV'),
 (10, 'Mia', 'Rodriguez', '6229EN')]

In [18]:
%%sql
SELECT * FROM ingredient;

 * mysql://root:***@localhost/resteurant_db
11 rows affected.

[(1, 'Tomato', Decimal('0.50'), 1, 1),
 (2, 'Cheese', Decimal('1.00'), 0, 1),
 (3, 'Lettuce', Decimal('0.30'), 1, 1),
 (4, 'Chicken', Decimal('2.50'), 0, 0),
 (5, 'Olive Oil', Decimal('3.00'), 1, 1),
 (6, 'Eggplant', Decimal('1.20'), 1, 1),
 (7, 'Ham', Decimal('3.50'), 0, 0),
 (8, 'Tomato Sauce', Decimal('2.00'), 1, 1),
 (9, 'Spinach', Decimal('4.00'), 1, 1),
 (10, 'Burrata', Decimal('1.80'), 0, 1),
 (11, 'Basil', Decimal('3.70'), 1, 1)]